

/**************************************************************************************
*	描述：这个文件是对与BP神经网络计算相关的函数进行声明
*	Copy(c) Rights By RongfangLiu,2014-2019
*	All Rights Reserved. 引用需注明出处
*	联系作者请发邮件至：752444247@qq.com
**************************************************************************************/

#ifndef _MY_BPNET_
#define _MY_BPNET_



/*************************************************
函数名称: ForwardLayer()
描述:  对图像进行模板操作
输入: lay1 前级节点数组，lay2 后级节点数组，connWeight 连接权值，n1 前级节点个数，n2 后级节点个数
输出: 
返回值: 正常返回值 0
写作日期: 2014/01/29 
*************************************************/
int ForwardLayer(double *lay1, double *lay2, double **connWeight, int n1, int n2);		//前向传播

/*************************************************
函数名称: CalcOutError()
描述:  计算输出层误差
输入: delta 误差数组，输出 输出节点数组，target 目标输出，n 输出层节点个数
输出: 
返回值: 正常返回值 0
写作日期: 2014/01/29 
*************************************************/

int CalcOutError(double *delta, double *输出, double *target, int n);			//输出层误差计算

/*************************************************
函数名称: CalcHiddErr()
描述:  计算隐含层误差
输入: delta_h 隐含层误差数组，n_h 隐含层节点数，delta_o 输出层误差数组，n_o 输出层节点个数，weight 连接权值数组，hidden 隐含层节点数组
输出: 
返回值: 正常返回值 0
写作日期: 2014/01/29 
*************************************************/

void CalcHiddErr(double *delta_h, int n_h, double *delta_o, \
					int n_o, double **weight, double *hidden);			//隐含层误差计算
					
/*************************************************
函数名称: AdjustWeight()
描述:  根据当前层节点值、计算误差和前一层节点值，修正连接权
输入: delta 当前层误差数组，n_delta 当前层节点数，forwd 前一层误差数组，n_fo 前一层节点个数，
		weight 连接权值数组，oldw 旧连接权数组，lrate 学习率，momentum 动量因子
输出: 
返回值: 正常返回值 0
写作日期: 2014/01/29 
*************************************************/

void AdjustWeight(double *delta, int n_delta, double *forwd, int n_fo, \
				double **weight, double **oldw, double lrate, double momentum);		//误差反向传播，调整权值
				
				
/*************************************************
函数名称: TrainBpNet()
描述:  训练神经网络
输入: preci 想达到的精度
输出: Dst 目标图像的指针
返回值: 正常返回值 0
写作日期: 2014/01/29 
*************************************************/
int TrainBpNet(double preci);	//训练BP神经网络

/*************************************************
函数名称: TrainBpNet()
描述:  对图像进行模板操作
输入: Src 指向源图像的指针，srcWidth 源图像的宽度，srcHeight 源图像的高度，tepl 模板数组，size 模板大小，fac 系数
输出: Dst 目标图像的指针
返回值: 正常返回值 0
写作日期: 2014/01/29 
*************************************************/
int Recongnize();	//用训练好的网络来识别
				
				
				
				
				
				
				
				
				
				
				
				
				
				
#endif